[
  {
    "version": "3.5.14-beta30",
    "time": "2024-09-16",
    "content": [
      "New: slight delay to countdown events based on the latency, so players can start the game around the same time. This likely won't matter much as usually they mostly differ in their framerates instead of latency, but it could still help in certain scenarios."
    ]
  },
  {
    "version": "3.5.13-beta29",
    "time": "2024-05-03",
    "content": [
      "New: server now broadcasts latency data to clients (i.e. clients can now see each others' pings)."
    ]
  },
  {
    "version": "3.5.12-beta28",
    "time": "2024-04-04",
    "content": [
      "Fix: duplicate failures messages trying to restart other players.",
      "New: the server can now change level-initial lives of players based on configured maps."
    ]
  },
  {
    "version": "3.5.11-beta27",
    "time": "2024-02-29",
    "content": [
      "New: server-wide broadcast for restart request failures."
    ]
  },
  {
    "version": "3.5.10-beta26",
    "time": "2024-02-27",
    "content": [
      "Fix: first-launch crash with BMMO installed.",
      "Fix: config path issue with BMLPlus <small>(details: some BMLPlus builds use <code>ModLoader/Config<b>s</b></code> to store mod configurations, instead of the more-common <code>ModLoader/Config</code> directory)</small>."
    ]
  },
  {
    "version": "3.5.10-beta25",
    "time": "2024-02-09",
    "content": [
      "New: text colors are now preserved in console text cache (shown when opening the console).",
      "Fix: reverted console changes for Windows 7, which doesn't seem to have support for Unicode input/output (Unicode is still used for newer Windows versions).",
      "Fix: race condition during parallel log outputs.",
      "Fix: console crash when trying to access history after start-ups."
    ]
  },
  {
    "version": "3.5.10-beta24",
    "time": "2024-02-04",
    "content": [
      "New: <code>/mmo restartlevel</code> command for restarting other players' levels.",
      "Fix: the ingame console now fully supports and uses UTF-8 input/output.",
      "Fix: rare crashes during startup (caused by a race condition where the mod tries to init its GUIs during BML initialization)."
    ]
  },
  {
    "version": "3.5.9-beta23",
    "time": "2024-01-28",
    "content": [
      "New: <code>/mmo crash</code> command.",
      "Fix: opacities of spirit balls are now reset at regular intervals; hopefully this fixes the incorrect opacity issue."
    ]
  },
  {
    "version": "3.5.9-beta22",
    "time": "2024-01-12",
    "content": [
      "New: servers now detect the infinite lives modification."
    ]
  },
  {
    "version": "3.5.8-beta21",
    "time": "2023-12-29",
    "content": [
      "Fix: <code>/mmo hide</code> (hiding the console) no longer crashes the game."
    ]
  },
  {
    "version": "3.5.8-beta20",
    "time": "2023-12-28",
    "content": [
      "New: console tab completion.",
      "Change: commands like <code>/mmo kick</code> now only hints player names unless the input has a <code>#</code> as its prefix; in that case player connection IDs are hinted."
    ]
  },
  {
    "version": "3.5.8-beta19",
    "time": "2023-12-18",
    "content": [
      "New: servers can now force new name on their players.",
      "Fix: removed random junk texts on the Fatal Error message box."
    ]
  },
  {
    "version": "3.5.8-beta18",
    "time": "2023-12-16",
    "content": [
      "New: Highscore Timer Calibration &ndash; this finally enables the player to rejoin in highscore mode if they were to crash unexpectedly mid-game.",
      "Change: tweaked some display details of important notifications."
    ]
  },
  {
    "version": "3.5.7-beta17",
    "time": "2023-11-24",
    "content": [
      "Fix: The <i>Fatal Error</i> message box now only displays once when the game crashes.",
      "New: clients now notify the server when their balls fall (currently this has no uses)."
    ]
  },
  {
    "version": "3.5.7-beta16",
    "time": "2023-11-18",
    "content": [
      "Fix: text display of permanent notifications / bulletins.",
      "Fix: <code>/mmo scores</code> now displays <i>DNF</i> messages correctly."
    ]
  },
  {
    "version": "3.5.7-beta15",
    "time": "2023-11-18",
    "content": [
      "Change: <i>DNF</i> messages now show the furthest-reached sector.",
      "Fix: players that have forfeited the game by sending the <i>DNF</i> message are no longer able to trigger new <i>DNF</i> messages or level-finish announcements.",
      "Change: clients now sync score data from the server with <code>/mmo scores</code> so they can still view previous level rankings even after game restarts. Local data is still accessible with <code>/mmo scores local</code>."
    ]
  },
  {
    "version": "3.5.6-beta14",
    "time": "2023-11-10",
    "content": [
      "Change: minor tweaks to the position of Notice texts.",
      "Change: slightly optimized the server list GUI."
    ]
  },
  {
    "version": "3.5.6-beta13",
    "time": "2023-11-08",
    "content": [
      "New: <code>/mmo notice</code> for a slightly less intrusive version of announcements.",
      "Fix: another font size glitch of sidebar player list.",
      "Fix: server list can no longer be affected by key inputs after leaving it."
    ]
  },
  {
    "version": "3.5.5-beta12",
    "time": "2023-11-04",
    "content": [
      "New: <code>/mmo a</code> and <code>/mmo b</code> as new aliases for <code>/mmo announce</code> and <code>/mmo bulletin</code>",
      "New: <code>/mmo uuid</code> for exporting the UUID.",
      "Change: improved efficiency with command executions.",
      "Change: tweaked the font size of score list so it's now adjusted according to the player count.",
      "Fix: font size glitch of sidebar player list.",
      "Fix: client no longer hangs exiting the game after playing sound stream messages from server.",
      "Fix: client no longer hangs trying to join the server again after getting denied.",
      "Fix: <i>Fatal Error</i> message box now outlives the game itself; it would remain even after the main window had crashed."
    ]
  },
  {
    "version": "3.5.5-beta11",
    "time": "2023-10-28",
    "content": [
      "New: switched to using linear extrapolation for spirit balls from players with very low update interval variances, as it offers smoother movements; quadratic extrapolation is still used for players with moderate variances (for less deviation from actual positions).",
      "Fix: <code>/mmo tp</code> now works correctly (it was broken since the very beginning and somehow flew under the radar for more than a year!).",
      "Fix: nametag flickering issue with ball transformers."
    ]
  },
  {
    "version": "3.5.5-beta10",
    "time": "2023-10-25",
    "content": [
      "New: score list and level finish messages now display player's actual level mode.",
      "Fix: spirit balls from players with high update interval variances (usually caused by poor connection qualities) are no longer extrapolated."
    ]
  },
  {
    "version": "3.5.4-beta9",
    "time": "2023-10-20",
    "content": [
      "New: made the server selection screen mouse-controllable.",
      "Fix: sidebar player list now ignores events of spectators reaching sectors."
    ]
  },
  {
    "version": "3.5.4-beta8",
    "time": "2023-10-18",
    "content": [
      "New: the sidebar player list now displays time differences of reaching each sector between players.",
      "New: <code>/mmo scores</code> now displays <i>DNF</i> data and a counter.",
      "<i>Notes: this version requires at least BML 0.3.43 or BMLPlus 0.2.3.</i>"
    ]
  },
  {
    "version": "3.5.3-beta7",
    "time": "2023-10-10",
    "content": [
      "New: built-in server list and manager.",
      "New: colorized console output using ANSI sequences.",
      "Fix: <code>/mmo whisper</code> should work again.",
      "<i>Notes: this version was re-uploaded on 2023-10-11 with some color adjustments and a slightly more polished server manager.</i>"
    ]
  },
  {
    "version": "3.5.2-beta6",
    "time": "2023-10-06",
    "content": [
      "Fix (maybe): some fatal errors caused by race conditions."
    ]
  },
  {
    "version": "3.5.2-beta5",
    "time": "2023-10-04",
    "content": [
      "Fix: reload server address ingame correctly.",
      "Change: improved crash dump saving fatal error message box with random quotes.",
      "New: support for multi-line important notifications and automatically insert line breaks using actual character widths."
    ]
  },
  {
    "version": "3.5.1-beta4",
    "time": "2023-09-28",
    "content": [
      "Fix: crashing caused by malformed messages.",
      "New: support for multi-line bulletin notifications (up to 3 lines)."
    ]
  },
  {
    "version": "3.5.0-beta2",
    "time": "2023-09-23",
    "content": [
      "Fix: commands with 3 words can now be executed correctly."
    ]
  },
  {
    "version": "3.5.0-beta1",
    "time": "2023-09-18",
    "content": [
      "New: <code>/mmo scores</code> command to view received rankings locally."
    ]
  },
  {
    "version": "3.5.0-alpha1",
    "time": "2023-09-08",
    "content": [
      "New: support for the Highscore Mode."
    ]
  },
  {
    "version": "3.4.10-beta16",
    "time": "2023-09-06",
    "content": [
      "New: wave sound notifications.",
      "New: ability for servers to send and play custom wave sounds."
    ]
  },
  {
    "version": "3.4.9-beta15",
    "time": "2023-08-25",
    "content": [
      "Change: reverted the extrapolation algorithm to that as of 3.4.8."
    ]
  },
  {
    "version": "3.4.9-beta14",
    "time": "2023-08-20",
    "content": [
      "Change: slightly improved the accuracy/precision of extrapolations and level completion timings."
    ]
  },
  {
    "version": "3.4.8-beta13",
    "time": "2023-08-08",
    "content": [
      "New: added an option to cancel beep sounds played on important server events."
    ]
  },
  {
    "version": "3.4.8-beta12",
    "time": "2023-07-20",
    "content": [
      "New: name changes are now limited to once every 24 hours.",
      "New: cooldown for DNF messages.",
      "Change: slightly increased the timeout threshold for loss of connection."
    ]
  },
  {
    "version": "3.4.7-alpha8",
    "time": "2023-07-12",
    "content": [
      "New: auto-reconnection back to the server after unintended loss of connection."
    ]
  },
  {
    "version": "3.4.6-beta11",
    "time": "2023-02-15",
    "content": [
      "Fix: auto-reconnection (triggered by modifying username, etc) now uses the address of the last connected server correctly."
    ]
  },
  {
    "version": "3.4.6-alpha7",
    "time": "2023-02-10",
    "content": [
      "New: opacities of spirit balls is now dynamically adjusted according to their distances to the player camera.",
      "Change: slightly decreased minimum font size of the player list."
    ]
  },
  {
    "version": "3.4.5-beta10",
    "time": "2023-01-24",
    "content": [
      "Change: moved UUID configuration to the <code>%AppData%</code> directory."
    ]
  },
  {
    "version": "3.4.5-alpha5 || 3.4.5-alpha6",
    "time": "2023-01-16",
    "content": [
      "New: ball state packets are now compressed to save bandwidth (theoretical maximum 38.6% saving on data rate)."
    ]
  },
  {
    "version": "3.4.4-beta9",
    "time": "2023-01-08",
    "content": [
      "Fix: log spam caused by incorrect ball state message handling."
    ]
  },
  {
    "version": "3.4.4-beta8",
    "time": "2023-01-06",
    "content": [
      "Change: updated the anti-cheating warning system."
    ]
  },
  {
    "version": "3.4.4-beta7",
    "time": "2022-12-30",
    "content": [
      "New: auto warning system for anti-cheating.",
      "Change: slightly reduced the size of ball state network packets."
    ]
  },
  {
    "version": "3.4.3-beta6",
    "time": "2022-12-08",
    "content": [
      "Change: automatic reconnection after modifying player name or server address."
    ]
  },
  {
    "version": "3.4.3-beta5",
    "time": "2022-12-02",
    "content": [
      "New: sound effects now plays during countdowns.",
      "New: taskbar icon of Ballance flashes after receiving new messages."
    ]
  },
  {
    "version": "3.4.2-beta4",
    "time": "2022-11-20",
    "content": [
      "New: permanent notifications.",
      "Change: font size of the player list is now more aggresively adjusted based on player count."
    ]
  },
  {
    "version": "3.4.1-beta3",
    "time": "2022-11-13",
    "content": [
      "Change: font size of the player list is now dynamically adjusted based on the total non-spectating player count."
    ]
  },
  {
    "version": "3.4.1-beta2",
    "time": "2022-11-06",
    "content": [
      "Change: server-side names of the same custom map now take priority when displaying the player list."
    ]
  },
  {
    "version": "3.4.0-beta1",
    "time": "2022-11-04",
    "content": [
      "Change: some minor stability improvements."
    ]
  },
  {
    "version": "3.4.0-alpha4",
    "time": "2022-10-31",
    "content": [
      "Change: the key binding used to toggle the real-time player list is changed to <code>Ctrl</code> + <code>Tab</code>.",
      "New: custom player list color configuration."
    ]
  },
  {
    "version": "3.4.0-alpha2 || 3.4.0-alpha3",
    "time": "2022-10-29",
    "content": [
      "Fix: Windows 7 compatibility.",
      "Fix: ordering of real-time player list."
    ]
  },
  {
    "version": "3.4.0-alpha1",
    "time": "2022-10-28",
    "content": [
      "Change: current maps of other players are now stored locally.",
      "New: <code>F3</code> + <code>H</code> for viewing others's current maps and sectors in real time.",
      "Fix: result of <code>/mmo list</code> is now sorted case-insensitively."
    ]
  },
  {
    "version": "3.3.7-beta14",
    "time": "2022-10-24",
    "content": [
      "Fix: font sizes of text sprites are now independent of system DPI.",
      "Fix: hide ANSI control charactors on platforms that does not support them (Windows 7).",
      "Change: player names are now sorted alphabetically when using <code>/mmo list</code>."
    ]
  },
  {
    "version": "3.3.7-beta13",
    "time": "2022-10-17",
    "content": [
      "Change: better extrapolation and server-side ticking."
    ]
  },
  {
    "version": "3.3.7-beta12",
    "time": "2022-10-08",
    "content": [
      "New: popup messages.",
      "Change: slightly adjusted the display of important notifications."
    ]
  },
  {
    "version": "3.3.6-beta11",
    "time": "2022-10-04",
    "content": [
      "New: auto reconnection when kicked by server under special circumstances.",
      "Change: important notifications are now displayed in the default system font.",
      "Fix: correctly display level completion time after a forced restart."
    ]
  },
  {
    "version": "3.3.6-beta10",
    "time": "2022-09-29",
    "content": [
      "New: servers will now validate clients' installed mods when joining."
    ]
  },
  {
    "version": "3.3.5-beta9",
    "time": "2022-09-20",
    "content": [
      "New: <code>/mmo announce</code> to announce important notifications."
    ]
  },
  {
    "version": "3.3.4-beta8",
    "time": "2022-09-15",
    "content": [
      "New: <code>Ctrl</code> + <code>5</code> to ask players for confirmation of readiness.",
      "New: server-side chat muting and banning settings.",
      "Fix: spectators are no longer able to use <code>/mmo ready</code> now."
    ]
  },
  {
    "version": "3.3.3-beta7",
    "time": "2022-09-08",
    "content": [
      "New: <code>Ctrl</code> + <code>4</code> to send the <i>Ready</i> messages.",
      "New: <code>/mmo ready</code> for confirming player is ready (<code>/mmo ready-cancel</code> to cancel).",
      "Fix: server times are used for duration of level completions whenever possible.",
      "Change: improved the style of <code>/mmo list</code>."
    ]
  },
  {
    "version": "3.3.3-beta6",
    "time": "2022-09-02",
    "content": [
      "New: <code>F3</code> + <code>A</code> as a shortcut to reload all spirit balls.",
      "New: <code>/mmo countdown</code> for automatic countdown.",
      "Fix: correctly restart levels on countdown for custom maps in <code>3D Entities\\Levels</code>.",
      "Change: font sizes in connection status display (togglable by pressing F3) are now set relative to window resolutions.",
      "Change: nametag labels should be closer to the center of spirit balls now."
    ]
  },
  {
    "version": "3.3.3-alpha7",
    "time": "2022-08-30",
    "content": [
      "New: Spectator Mode. Spectators are invisible to other players except in chat/login/logout messages, and are denoted by the prefix <code>*</code> in their names.",
      "Change: slightly tweaked extrapolation settings."
    ]
  },
  {
    "version": "3.3.2-beta4 || 3.3.2-beta5",
    "time": "2022-08-24",
    "content": [
      "Fix: spirit balls freezing from incorrect timestamps.",
      "Change: further lowered maximum extrapolation time/distance.",
      "New: <code>/mmo reload</code> to reload all spirit balls if player nametags are displayed at wrong positions."
    ]
  },
  {
    "version": "3.3.2-beta3",
    "time": "2022-08-18",
    "content": [
      "Fix: client now shows positions of stationary players correctly after joining the server.",
      "New: private chat by using <code>/mmo whisper &lt;player&gt; &lt;text&gt;</code> (also <code>/mmo w</code>).",
      "New: tab key completion for player names.",
      "New: case-insensitive search for player names.",
      "New: <code>Ctrl</code> + <code>Shift</code> + <code>↑</code> for resetting current camera orientation."
    ]
  },
  {
    "version": "3.3.1-beta2",
    "time": "2022-08-15",
    "content": [
      "New: only timestamps instead of full ball state messages are sent when a client is not moving.",
      "New: added <code>/mmo teleport</code> (must be used with Cheat Mode)."
    ]
  },
  {
    "version": "3.3.0-beta1",
    "time": "2022-08-14",
    "content": [
      "Fix: stop extrapolating when client is laggy (have not received ball state packets for a fixed time).",
      "New: added <code>/mmo announcemap</code> and <code>/mmo getpos</code>; <code>/mmo connect</code> can now be used together with server addresses."
    ]
  },
  {
    "version": "3.3.0-alpha6",
    "time": "2022-08-10",
    "content": [
      "Fix: extrapolation of rotation (now using the Slerp method)."
    ]
  },
  {
    "version": "3.3.0-alpha4 || 3.3.0-alpha5",
    "time": "2022-08-09",
    "content": [
      "Fix: older clients are now moving correctly after joining.",
      "Fix: reduced random flickering.",
      "Change: more optimization to extrapolation for smoother movements."
    ]
  },
  {
    "version": "3.3.0-alpha3",
    "time": "2022-08-08",
    "content": [
      "Fix: balls no longer flicker when extrapolation is enabled."
    ]
  },
  {
    "version": "3.3.0-alpha2",
    "time": "2022-08-08",
    "content": [
      "New: ball states are now sent with timestamps to prevent them from being processed without order.",
      "New: togglable quadratic extrapolation for movements of spirit balls to make them move smoother.",
      "Change: removed <code>@</code> and added <code>.</code> to characters available for nicknames."
    ]
  },
  {
    "version": "3.2.12-beta18",
    "time": "2022-08-06",
    "content": [
      "Fix: clients are now automatically kicked by the server upon encountering fatal errors to prevent further malformed packets and allow quicker reconnection (previously one need to wait ~15 seconds for the server to kick the dead client from timeouts; during this time period reconnection attempts are rejected).",
      "Change: hotkey for toggling own spirit ball is changed to <code>Ctrl</code> + <code>`</code>.",
      "New: nicknames consisting of only underscore characters are invalidated; they will be randomly regenerated.",
      "New: randomly generated names are more distinct now."
    ]
  },
  {
    "version": "3.2.12-beta17",
    "time": "2022-08-04",
    "content": [
      "Fix: optimized client ball state checks - they are now only done immediately before sending state messages (previous versions check ball states every frame, causing unnecessary performance losses).",
      "Change: removed <code>/kick-id</code>; use <code>/kick #<i>id</i></code> instead.",
      "New: added an option for server owners to induce fatal errors on clients."
    ]
  },
  {
    "version": "3.2.12-beta16",
    "time": "2022-07-31",
    "content": [
      "New: togglable own spirit ball (by using <code>`</code>) - can be helpful in laggy conditions.",
      "Fix: previous unability to show some spirit paper balls."
    ]
  },
  {
    "version": "3.2.11-beta15",
    "time": "2022-07-28",
    "content": [
      "New: validity of client Balls.nmo is checked after logging in and server now displays installed mods of clients.",
      "Fix: multi-line output now displays correctly in the console."
    ]
  },
  {
    "version": "3.2.10 and older",
    "time": "before 2022-07-27",
    "content": [
      "Working in progress ..."
    ]
  }
]
